викторина 2

Какое значение имеет символ + в математических операциях на JavaScript?
Действие сложения

Каким символомобозначается умножение в JavaScript?
*

Какой это тип данных? 3456
Числовой

Какое значение имееет символ / в математических операциях на JavaScript?
Действие деления

К какому типу данных будет принадлежать переменная чтоЗаТипДанных после запуска следующей строки
let чтоЗаТипДанных = 5;
Числовой

Что используется для разделения, групировки и определения выполнения математических операций, а также для того, чтобы написанное легче читалось?
Скобки (вот так)

С помощью какого символа можно было бы упростить следующее предложение:
мояПеременная = мояПеременная * 2
*=2 (мояПеременная *=2)

Какой символ используется в JavaScript для оператора modulo?
%

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная + 1;
мояПеременная ++; Инкремент

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная - 1;
мояПеременная --; Декремент

Каким образом надо изменить следующее предложение, чтобы оно означало "три уножить на сумму четырех и единицы":
3*4+1
3*(4+1)

Если бы вы писали код, который определяет четные и нечетные числа, какую цифру вы бы использовали с оператором modulo?
2

Используя какой символ можно было бы упростить следующее предложение:
моёЗначение = моёЗначение - 8;
моёЗначение -=8;

Сколько уникальных (то есть различных) чисел в ряду ответов оператора modulo вы бы получили, если бы делали серию делений целых чисел на 5 (скажем, 11%5; 12%5;...)
5 (0,1,2,3,4)

Как называют группу символов, которые сперва производят действие с переменной, а затем присваивают этой же переменной новое значение
(например, +=, -=, *=, /=)
Комбинированное присваивание

Вы решили написать код на JavaScript, который бы задавал следующую последовательность мигания светодиодов: красный, синий, зеленый, красный, синий зеленый и так далее. 
Какой из известных нам математических операторов был бы наиболее полезен при написании кода?
%, в нашем случае %3

Комплексный обзор 1

Как называется этот стиль: вЭтойПеременнойЕстьПрописныеБуквы?
Верблюжий регистр

Какой комбинацией открывается консоль в Chrome?
CTRL+SHIFT+J

Является ли следующее предложение правильным(и если нет - почему)?
var 1ыйНомерId = 1;
Неправильный, так как название переменной не может начинаться с числа

Является ли следующее предложение правильным(и если нет - почему)?
let номерIdУченика12 = 12;
Правильно

Так или нет: сообщения об ошибках - это помощь в написании кода?
Это помощь

Какую ошибку выдаст консоль, если в строке есть открывающая скобка, но нет закрывающей?
Uncaught Suntax Error: Unexpected token

Каким оператором стоит воспользоваться, чтобы узнать, делится ли некое число на 6?
%

Что необходимо ввести в адресной строке браузера, чтобы открыть пустую вкладку?
about:blank

Каким символом можно воспользоваться, чтобы следующее предложение не изменило смысл, но было записанно более коротко
матемЗначение = 7 + матемЗначение
матемЗначение += 7

Является ли следующий код правильным (и если нет - почему)?
var любимыеХлопья = 'Kix'; любимыеХлопья = 'Froot Loops';
любимыеХлопья;
Правильное

Является ли следующий код правильным (и если нет - почему)?
let любимыеХлопья = "Cap'n Crunch";
let любимыеХлопья = 'Lucky Charms';
любимыеХлопья;
Не правильно, дважды обьявленна одна функция

Викторина 3

Коментарии к коду будет читать ...
Человек

Какой тип данных является наиболее часто применяемым в работе с JavaScript?
строка

Интерпритатор JavaScript ... все встреченные им Коментарии
проигнорирует

Каким символом обозначается однострочный коментарий?
//

Какой комбинацией клавиш делается перенос строки в консоли?
SHIFT+ENTER

Строка в JavaScript заключается в
кавычки (ДВОЙНЫЕ ИЛИ ОДИНАРНЫЕ)

Каким символом открывается блок коментариев?
/*

Каким символом закрывается блок коментариев?
*/

Истина/Ложь: при работе со строками намного удобнее применять двойные ковычки, нежели ОДИНАРНЫЕ
ложь: кому как удобно

Строка состоит из одного или более ... 
символов

Что означает знак + при работе со строками в JavaScript?
Объединение

Какой символ нужно добавить в следующее предложение, чтобы избежать систаксической ошибки?
let цитатаИзФильма = 'the name's Bond. James Bond.';
let цитатаИзФильма = 'the name\'s Bond. James Bond.';

Как можно было изменить (ничего не добавляя) 2 знака в следующем предложении
чтобы избежать синтаксической ошибки?
let ещеОднаЦитатаИзФильма = 'Here's looking at you, kid.';
O: let ещеОднаЦитатаИзФильма = "Here's looking at you, kid.";

Комплексный разбор 2

Какой комбинацией клавиш открывается в Chrome консоль?
CTRL+SHIFT+J

Правильно ли написанно следующее предложение (и если нет - почему)?
(10+(4*2)-5)/(6-7);
правильно

Правильно ли написанно следующее предложение (и если нет - почему)?
let гонщикНомер8 = 8;
правильно

Что нужно ввести в адресной строке браузера, чтобы открыть пустую вкладку?
about:blank

Правильно ли написанно следующее предложение (и если нет - почему)?
let допустимоеЧисло % 4 = 2;
неправильно, между переменной и знаком равенства не должно быть символов

Истина/Ложь: сообщения об ошибке являются показателем, что, что-то идет не так
Истина

Как можно было бы короче записать вторую строчку в этом коде, получив при этом тот же результат:
let возраст = 12;
возраст = 1 + возраст
О: возраст +=1;

Где разработчик может легко и просто проверить работу написанного кода и получить немедленный ответ интерпритатора?
В среде разработчика в Chrome

Какой ошибкой на следующий код ореагирует консоль?
let letterBeforeM = 'N'; let letterBeforeM = 'L'; letterBeforeM;
Uncaught SyntaxError: Identifier 'letterBeforeM' has already been declared (дважды написанно let)

Правильно ли написанно следующее предложение (и если нет - почему)?
let делимое = 10;
let делитель = 3;
let сообщениеОБОстатке = 'При евклидовом делении ' + делимое + ' на ' + делитель + ' мы имеем в остатке ' + (делимое%делитель);
сообщениеОБОстатке;
О: правильно

Chrome, Firefox, Internet Explorer, Edge и Safari, все они являются ...
Браузерами

Каким образом следует писать имена переменных на JavaScript?
Верблюжий регистр

Что используется для разделения, групировки и определения порядка выплнения математических операций, а также для того, чтобы написанное легче читалось?
Скобки

Что за тип данных?
'2000'
Строка

Что за тип данных?
"Чашечка отменного кофе из медного кофейника"
Строка

Что означает одиночный знак равенства в предложении?
Оператор присваивания

Как можно было бы короче записать следующий код, получив при этом тот же результат:
let любимоеБлюдо = "Курочка";
любимоеБлюдо = любимоеБлюдо + " Бурито";
О: любимоеБлюдо += " Бурито";

Как называется оператор JavaScript, при котором используется знак процента?
modulo

Правильно ли написанно следующий код (и если нет - почему)?
let любимыеЧипсы = "Fritos";
// let любимыеЧипсы = "Doritos";
// любимыеЧипсы
О: результат не будет выведен, так как закоментирован

Правильно ли написанно следующий код (и если нет - почему)?
/* let любимыйПопкорн = "С маслом";
let любимыйПопкорн = "С карамелью"; */
let любимыйПопкорн;
О: результат не будет выведен, так как все значения переменной закоментированны

let имяПрограмиста = "Николай";
let фамилияПрограмиста = "Ершов"; // нужно только для того, чтобы потом создать "полноеИмяПрограмиста"
let отчествоПрограмиста = "Андреевич" // нужно только для того, чтобы потом создать "полноеИмяПрограмиста"
let полноеИмяПрограмиста = имяПрограмиста + " " + фамилияПрограмиста + " " + отчествоПрограмиста; 
let названиеПроэкта = "Вечная Россия";
let возраст = 34; 
let хобби = "кодить, новости, компьютерные игры";
let цитата = 'Дорога возникает под шагами идущего';
let bio = полноеИмяПрограмиста + "-" + возраст + '-летний писатель, автор нашумевшей работы "' + названиеПроэкта + '". В свободное время ' + имяПрограмиста + 'любит ' + хобби + 'и проводить время в кругу родных и близких.'
+ "Вот любимая цитата " + имяПрограмиста + ' из "' + названиеПроэкта + '": "' + цитата + '""';

function вывестиЦифруПять() {
    return 5;
};

function путишествиеВоВремени(питомец) {
    let максГод = 2500; // дальше этого года мы отсылать зверей не будем
    let год = Math.random() * максГод;
    return "Ваш " + питомец + " отправляется во времени в год " + Math.floor(год) + "!";
}

Викторина 4

Как называется отдельный блок кода, который можно вызвать для выполнения какого либо действия?
функция

В какие символы заключается функция?
В {}

Создав функцию, я могу её использовать в будующем? Как называется запуск функции в команде?
Да, функцию можно объявить. Вызов функции

В каком стиле должно быть прописанно название функции?
верблюжим регистром

Как называется часть функции, которая что-то выдает нам назад, после вызова функции?
return

Когда мы возвращаем функцию, в её скобках может быть заключена переменная (или переменные), которые называются ... 
Когда мы вызываем функцию, то тому, что заключено в скобки, мы можем присвоить значения, называемые ...
Параметр, аргумент

Назовите английскую аббревиатуру, обозначающую принцип, согласно которому разработчик не должен повторять один и тотже блок кода по многу разбор
DRY

Каждая из четырех рассмотренных в главе встроенных функций наиболее раздражающе действует на пользователей
(особенно если встречается им не оди раз)
alert ()

Когда предполагается задать аргументам функции более одного значения,
каким символом они должны отделяться друг от друга?
,

Какая встроенная функция позволяет очень легко и просто оставлять супер секретные сообщеня для разработчиков
(или для самого себя, если вы работаете над улучшением собственного кода)?
console.log

Даже если к функции ничего нельзя прибавить или внести в неё измененения , какие символы необходимы для её запуска?
()

Встроенная функция нахождения случайных чисел возвращает значение больше ... и меньше ...
больше 0 и меньше 1

Какая встроенная функция округляет число в меньшую сторону до ближайшего целого?
Math.floor

Истина/ложь: функция может быть упакованна в другую функцию
Истина

Истина/ложь: когда происходит вычисление значения вложенной функции, интерпретатор сперва вычисляет значение внутренней, а затем внешней функции?
Истина

Истина/ложь: во время работы с вложенной функцией интерпритатор будет использовать параметр внутренней функции
и передаст его в качестве аргумента внешней
ложь, интерпритатор ВЫЧИСЛЯЕТ возвращаемое значение (результат) внешней функции, а затем передаст его в качестве аргумента внешней


При помощи какой клавиши можно выделить код отступом, чтобы он легче читался (например, внутри функции)
TAB

Как задать переход на новую строчку в консоли?
\n

function логПрогноза() {
    let прогноз = 'облачно, возможны осадки в виде фрикаделек';
    let сообщениеПрогноза = "Погода на сегодня: " + прогноз;
    console.log(сообщениеПрогноза);
    return прогноз;
}
alert('Прогноз погоды: \n' + логПрогноза());

function какТебяЗовут(имя) {
    let сообщение = 'Тебя зовут \n' + имя;
    console.log(сообщение);
    alert(сообщение);
    return(сообщение);
}
какТебяЗовут ('<Николай>');

function твояЛюбимаяИгрушка (любимяИгрушка, возраст) {
    return 'Тебе уже ' + возраст + ', а тебе все еще нравится ' + любимяИгрушка + '?';
}
твояЛюбимаяИгрушка ('Пикачу', '34 года');

function бросаемИгральныйКубик () { // Обычный игральный кубик с 6 сторанами
    /* Нам придется прибавить 1, поскольку в противном случае Math.floor() будет
    выдавать результат в диапазоне от 0 до 5 */
    return Math.floor(Math.random() * 6) + 1; 
}
бросаемИгральныйКубик();

function параИгральныхКубиков () {
    let кубик1 = бросаемИгральныйКубик();
    let кубик2 = бросаемИгральныйКубик();
    let сумма = кубик1 + кубик2;
    console.log('У вас выпало ' + сумма + '!(' + кубик1 + ' и ' + кубик2 + ')');
    return сумма;
}

Комплексный обзор

Какой тип данных заключается в одинарные или двойные кавычки?
строка

Какие два способа объявления переменных мы расматривали?
var и let

Истина/ложь: интерпритатор JavaScript игнорирует коментарии?
Истина

Правильно ли написанно следующее предложение (и еслинпет-почему)?
var почему6Испугалась7 = 'потому что 7 съела 9';
Правильно

Какой знак надо вставить в следующее предложение, чтобы избежать синтаксической ошибки?
let славнаяПесенка = 'They Can't Take That Away From Me.';
let славнаяПесенка = 'They Can\'t Take That Away From Me.';

Истина/ложь: благодаря использованию функций можно эффективно следовать принципу W.E.T. (знаменитому принципу мокрости)
ложь

Выполняет ли следующий код, то что хочет от него разработчик?
let днейВгоду = 365; /* вернемся к этому позже
нет не выполняет отсутствует закрытие коментария */

Какой тип данных?
0
Числовой

Какой символ используется для однострочных комментариев?
//

Строка в JavaScript состоит из отдельных ...bio
символов

Какой символ соответствует оператору modulo?
%

Истина/ложь: строка не должна содержать двойные кавычки, кроме тех случаев, когда строка заключена в одинарные кавычки
Ложь, строка может содержать любые типы кавычек

Какой результат расчитывает получить разработчик, используя оператор modulo?
Получить остаток от деления

Истина/ложь сообщения об ошибках предназначены только для людей
Истина

Какого цвета трава :)
В основном зеленая

Где разработчик может легко и просто проверить работу написанного кода
и получить немедленный ответ интерпритатора?
В меню разработчика в Chrome

Правильно ли написанно следующее предложение, и если нет - почему?
function найтиОстаток (делимое, делитель) {
    let сообщениеОбОстатке = 'При евклидовом делении ' + делимое + ' на ' + делитель + ' мы имеем в остатке ' + (делимое%делитель);
    return сообщениеОбОстатке;
}
найтиОстаток(10, 3);
Выражение написанно правильно

Каким оператором стоит воспользоваться, чтобы узнать делится ли число нацело на 6?
%

При помощи какого символа можно было бы упростить следующее присвоение?
огромноеЧисло = огромноеЧисло + 19;
огромноеЧисло += 19;

Какой это тип данных?
'75'
Строка

Правильно ли написанно следующее предложение, и если нет - почему?
function необходимыйВозраст (5) {
    // Дети младше 5 на карусель не допускаются;
    return 5;
}
необходимыйВозраст (5);
Неправильно: переменная не может быть заданна числом

Для чего в консоли применяется комбинация SHIFT+ENTER?
Перенос текста на новую строчку

При помощи какой клавиши можно выделить код отступом, чтобы он легче читался (например внутри функции)?
TAB

Верен ли следующий код (и если нет - почему)?
function найтиСлучайноеЧисло (мин, максЧисло) {
    return Math.floor(Math.random()*максЧисло);
}
найтиСлучайноеЧисло(20); // нужно число которое было бы меньше 20
Не верен, так как заданны две переменные, а мы просим вывести одну (минимальное значение)

Если вызываете функцию, которая находится внутри другой функции, то такую функцию называют ...
Вложенной функцией

function результатЛотереи () {
    let первоеЧисло = Math.floor(Math.random () * 100);
    let второеЧисло = Math.floor(Math.random () * 100);
    let третьеЧисло = Math.floor(Math.random () * 100);
    console.log(первоеЧисло + ' - ' + второеЧисло + ' - ' + третьеЧисло);
}
результатЛотереи ()

let булевоЗначение = true;
if (булевоЗначение) {
    console.log ("Этот код запустится");
}


