викторина 2

Какое значение имеет символ + в математических операциях на JavaScript?
Действие сложения

Каким символомобозначается умножение в JavaScript?
*

Какой это тип данных? 3456
Числовой

Какое значение имееет символ / в математических операциях на JavaScript?
Действие деления

К какому типу данных будет принадлежать переменная чтоЗаТипДанных после запуска следующей строки
let чтоЗаТипДанных = 5;
Числовой

Что используется для разделения, групировки и определения выполнения математических операций, а также для того, чтобы написанное легче читалось?
Скобки (вот так)

С помощью какого символа можно было бы упростить следующее предложение:
мояПеременная = мояПеременная * 2
*=2 (мояПеременная *=2)

Какой символ используется в JavaScript для оператора modulo?
%

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная + 1;
мояПеременная ++; Инкремент

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная - 1;
мояПеременная --; Декремент

Каким образом надо изменить следующее предложение, чтобы оно означало "три уножить на сумму четырех и единицы":
3*4+1
3*(4+1)

Если бы вы писали код, который определяет четные и нечетные числа, какую цифру вы бы использовали с оператором modulo?
2

Используя какой символ можно было бы упростить следующее предложение:
моёЗначение = моёЗначение - 8;
моёЗначение -=8;

Сколько уникальных (то есть различных) чисел в ряду ответов оператора modulo вы бы получили, если бы делали серию делений целых чисел на 5 (скажем, 11%5; 12%5;...)
5 (0,1,2,3,4)

Как называют группу символов, которые сперва производят действие с переменной, а затем присваивают этой же переменной новое значение
(например, +=, -=, *=, /=)
Комбинированное присваивание

Вы решили написать код на JavaScript, который бы задавал следующую последовательность мигания светодиодов: красный, синий, зеленый, красный, синий зеленый и так далее. 
Какой из известных нам математических операторов был бы наиболее полезен при написании кода?
%, в нашем случае %3

Комплексный обзор 1

Как называется этот стиль: вЭтойПеременнойЕстьПрописныеБуквы?
Верблюжий регистр

Какой комбинацией открывается консоль в Chrome?
CTRL+SHIFT+J

Является ли следующее предложение правильным(и если нет - почему)?
var 1ыйНомерId = 1;
Неправильный, так как название переменной не может начинаться с числа

Является ли следующее предложение правильным(и если нет - почему)?
let номерIdУченика12 = 12;
Правильно

Так или нет: сообщения об ошибках - это помощь в написании кода?
Это помощь

Какую ошибку выдаст консоль, если в строке есть открывающая скобка, но нет закрывающей?
Uncaught Suntax Error: Unexpected token

Каким оператором стоит воспользоваться, чтобы узнать, делится ли некое число на 6?
%

Что необходимо ввести в адресной строке браузера, чтобы открыть пустую вкладку?
about:blank

Каким символом можно воспользоваться, чтобы следующее предложение не изменило смысл, но было записанно более коротко
матемЗначение = 7 + матемЗначение
матемЗначение += 7

Является ли следующий код правильным (и если нет - почему)?
var любимыеХлопья = 'Kix'; любимыеХлопья = 'Froot Loops';
любимыеХлопья;
Правильное

Является ли следующий код правильным (и если нет - почему)?
let любимыеХлопья = "Cap'n Crunch";
let любимыеХлопья = 'Lucky Charms';
любимыеХлопья;
Не правильно, дважды обьявленна одна функция

Викторина 3

Коментарии к коду будет читать ...
Интерпритатор JavaScript

Какой тип данных является наиболее часто применяемым в работе с JavaScript?
строка

Интерпритатор JavaScript ... все встреченные им Коментарии
проигнорирует

Каким символом обозначается однострочный коментарий?
//

Какой комбинацией клавиш делается перенос строки в консоли?
SHIFT+ENTER

Строка в JavaScript заключается в
кавычки (ДВОЙНЫЕ ИЛИ ОДИНАРНЫЕ)

Каким символом открывается блок коментариев?
/*

Каким символом закрывается блок коментариев?
*/

Истина/Ложь: при работе со строками намного удобнее применять двойные ковычки, нежели ОДИНАРНЫЕ
кому как удобно

Строка состоит из одного или более ... 
знаков

Что означает знак + при работе со строками в JavaScript?
сложение двух строка

Какой символ нужно добавить в следующее предложение, чтобы избежать систаксической ошибки?
let цитатаИзФильма = 'the name's Bond. James Bond.';
let цитатаИзФильма = 'the name\'s Bond. James Bond.';

Как можно было изменить (ничего не добавляя) 2 знака в следующем предложении
чтобы избежать синтаксической ошибки?
let ещеОднаЦитатаИзФильма = 'Here's looking at you, kid.';
O: let ещеОднаЦитатаИзФильма = "Here's looking at you, kid.";


