викторина 2

Какое значение имеет символ + в математических операциях на JavaScript?
Символ сложения

Каким символомобозначается умножение в JavaScript?
*

Какой это тип данных? 3456
Числовой

Какое значение имееет символ / в математических операциях на JavaScript?
Символ деления

К какому типу данных будет принадлежать переменная чтоЗаТипДанных после запуска следующей строки
let чтоЗаТипДанных = 5;
Числовой

Что используется для разделения, групировки и определения выполнения математических операций, а также для того, чтобы написанное легче читалось?
Икремент и декремент

С помощью какого символа можно было бы упростить следующее предложение:
мояПеременная = мояПеременная * 2
*=2

Какой символ используется в JavaScript для оператора modulo?
%

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная + 1;
мояПеременная ++; Инкремент

Найдите простейший (то есть кратчайший) способ записи; как называется использованный символ?
мояПеременная = мояПеременная - 1;
мояПеременная --; Декремент

Каким образом надо изменить следующее предложение, чтобы оно означало "три уножить на сумму четырех и единицы":
3*4+1
3*(4+1)